; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=204, out_folder=./training, instance_id=28, seed=2052, goal_proportion=0.03

(define (problem blocksworld-28)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b38)
    (on b38 b128)
    (on b128 b5)
    (on b5 b175)
    (on b175 b120)
    (on b120 b49)
    (on b49 b11)
    (on b11 b187)
    (on b187 b59)
    (on b59 b117)
    (on-table b117)
    (clear b97)
    (on b97 b67)
    (on-table b67)
    (clear b201)
    (on b201 b72)
    (on b72 b119)
    (on b119 b148)
    (on b148 b133)
    (on b133 b37)
    (on b37 b30)
    (on b30 b95)
    (on b95 b73)
    (on b73 b179)
    (on-table b179)
    (clear b105)
    (on-table b105)
    (clear b131)
    (on b131 b195)
    (on b195 b31)
    (on-table b31)
    (clear b174)
    (on b174 b78)
    (on-table b78)
    (clear b20)
    (on b20 b170)
    (on b170 b112)
    (on b112 b184)
    (on b184 b80)
    (on-table b80)
    (clear b193)
    (on b193 b200)
    (on b200 b125)
    (on b125 b14)
    (on b14 b203)
    (on b203 b115)
    (on-table b115)
    (clear b183)
    (on-table b183)
    (clear b51)
    (on b51 b9)
    (on b9 b96)
    (on-table b96)
    (clear b202)
    (on b202 b42)
    (on b42 b7)
    (on b7 b32)
    (on b32 b36)
    (on b36 b18)
    (on b18 b139)
    (on b139 b81)
    (on b81 b199)
    (on-table b199)
    (clear b137)
    (on b137 b121)
    (on b121 b74)
    (on-table b74)
    (clear b19)
    (on b19 b61)
    (on b61 b114)
    (on-table b114)
    (clear b40)
    (on-table b40)
    (clear b124)
    (on b124 b62)
    (on b62 b150)
    (on-table b150)
    (clear b169)
    (on b169 b70)
    (on b70 b152)
    (on b152 b116)
    (on b116 b177)
    (on b177 b196)
    (on b196 b198)
    (on b198 b83)
    (on b83 b118)
    (on b118 b60)
    (on b60 b69)
    (on b69 b23)
    (on b23 b160)
    (on b160 b91)
    (on b91 b87)
    (on b87 b188)
    (on b188 b156)
    (on b156 b15)
    (on b15 b89)
    (on-table b89)
    (clear b45)
    (on-table b45)
    (clear b68)
    (on b68 b159)
    (on b159 b75)
    (on b75 b127)
    (on-table b127)
    (clear b22)
    (on b22 b144)
    (on b144 b157)
    (on b157 b86)
    (on b86 b2)
    (on b2 b44)
    (on-table b44)
    (clear b197)
    (on b197 b98)
    (on-table b98)
    (clear b130)
    (on b130 b165)
    (on b165 b47)
    (on b47 b140)
    (on b140 b155)
    (on b155 b111)
    (on b111 b158)
    (on-table b158)
    (clear b63)
    (on b63 b101)
    (on b101 b8)
    (on b8 b191)
    (on b191 b26)
    (on b26 b190)
    (on-table b190)
    (clear b189)
    (on b189 b66)
    (on-table b66)
    (clear b185)
    (on b185 b163)
    (on-table b163)
    (clear b164)
    (on b164 b71)
    (on b71 b10)
    (on b10 b113)
    (on b113 b94)
    (on-table b94)
    (clear b167)
    (on b167 b88)
    (on-table b88)
    (clear b48)
    (on-table b48)
    (clear b41)
    (on b41 b100)
    (on b100 b154)
    (on-table b154)
    (clear b79)
    (on-table b79)
    (clear b181)
    (on-table b181)
    (clear b77)
    (on b77 b172)
    (on b172 b143)
    (on-table b143)
    (clear b162)
    (on b162 b93)
    (on b93 b58)
    (on b58 b141)
    (on b141 b153)
    (on-table b153)
    (clear b46)
    (on b46 b110)
    (on-table b110)
    (clear b43)
    (on b43 b182)
    (on b182 b33)
    (on b33 b28)
    (on b28 b39)
    (on b39 b76)
    (on b76 b27)
    (on b27 b135)
    (on-table b135)
    (clear b180)
    (on b180 b92)
    (on b92 b55)
    (on b55 b149)
    (on b149 b122)
    (on b122 b29)
    (on b29 b108)
    (on b108 b145)
    (on b145 b50)
    (on b50 b13)
    (on b13 b109)
    (on b109 b24)
    (on b24 b178)
    (on b178 b126)
    (on b126 b34)
    (on b34 b90)
    (on b90 b194)
    (on b194 b204)
    (on b204 b21)
    (on b21 b107)
    (on-table b107)
    (clear b186)
    (on b186 b142)
    (on-table b142)
    (clear b129)
    (on b129 b52)
    (on b52 b106)
    (on b106 b136)
    (on b136 b161)
    (on b161 b65)
    (on b65 b84)
    (on-table b84)
    (clear b16)
    (on-table b16)
    (clear b3)
    (on-table b3)
    (clear b12)
    (on b12 b53)
    (on b53 b151)
    (on b151 b104)
    (on b104 b64)
    (on b64 b166)
    (on b166 b56)
    (on b56 b82)
    (on b82 b4)
    (on-table b4)
    (clear b54)
    (on b54 b192)
    (on b192 b173)
    (on-table b173)
    (clear b123)
    (on-table b123)
    (clear b102)
    (on-table b102)
    (clear b134)
    (on b134 b35)
    (on b35 b147)
    (on b147 b25)
    (on-table b25)
    (clear b146)
    (on-table b146)
    (clear b99)
    (on b99 b17)
    (on b17 b57)
    (on b57 b6)
    (on b6 b168)
    (on b168 b138)
    (on b138 b176)
    (on b176 b103)
    (on b103 b132)
    (on-table b132)
    (clear b85)
    (on b85 b171)
    (on-table b171))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b5)
    (on b5 b6)
    (on b6 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b12 b53)
   deleted: (on b12 b53) (clear b12) (arm-empty)
   added: (holding b12) (clear b53)
   goals met: 1 of 7
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 7
3. (unstack b22 b144)
   deleted: (on b22 b144) (clear b22) (arm-empty)
   added: (holding b22) (clear b144)
   goals met: 1 of 7
4. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 7
5. (unstack b144 b157)
   deleted: (on b144 b157) (clear b144) (arm-empty)
   added: (holding b144) (clear b157)
   goals met: 1 of 7
6. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 1 of 7
7. (unstack b157 b86)
   deleted: (on b157 b86) (clear b157) (arm-empty)
   added: (holding b157) (clear b86)
   goals met: 1 of 7
8. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 1 of 7
9. (unstack b53 b151)
   deleted: (on b53 b151) (clear b53) (arm-empty)
   added: (holding b53) (clear b151)
   goals met: 1 of 7
10. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 1 of 7
11. (unstack b151 b104)
   deleted: (on b151 b104) (clear b151) (arm-empty)
   added: (holding b151) (clear b104)
   goals met: 1 of 7
12. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 1 of 7
13. (unstack b104 b64)
   deleted: (on b104 b64) (clear b104) (arm-empty)
   added: (holding b104) (clear b64)
   goals met: 1 of 7
14. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 1 of 7
15. (unstack b64 b166)
   deleted: (on b64 b166) (clear b64) (arm-empty)
   added: (holding b64) (clear b166)
   goals met: 1 of 7
16. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 1 of 7
17. (unstack b166 b56)
   deleted: (on b166 b56) (clear b166) (arm-empty)
   added: (holding b166) (clear b56)
   goals met: 1 of 7
18. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 1 of 7
19. (unstack b56 b82)
   deleted: (on b56 b82) (clear b56) (arm-empty)
   added: (holding b56) (clear b82)
   goals met: 1 of 7
20. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 1 of 7
21. (unstack b82 b4)
   deleted: (on b82 b4) (clear b82) (arm-empty)
   added: (holding b82) (clear b4)
   goals met: 2 of 7
22. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 2 of 7
23. (unstack b86 b2)
   deleted: (on b86 b2) (clear b86) (arm-empty)
   added: (holding b86) (clear b2)
   goals met: 2 of 7
24. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 2 of 7
25. (unstack b99 b17)
   deleted: (on b99 b17) (clear b99) (arm-empty)
   added: (holding b99) (clear b17)
   goals met: 2 of 7
26. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 2 of 7
27. (unstack b17 b57)
   deleted: (on b17 b57) (clear b17) (arm-empty)
   added: (holding b17) (clear b57)
   goals met: 2 of 7
28. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 7
29. (unstack b57 b6)
   deleted: (on b57 b6) (clear b57) (arm-empty)
   added: (holding b57) (clear b6)
   goals met: 2 of 7
30. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 2 of 7
31. (unstack b2 b44)
   deleted: (on b2 b44) (clear b2) (arm-empty)
   added: (holding b2) (clear b44)
   goals met: 2 of 7
32. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 7
33. (unstack b6 b168)
   deleted: (on b6 b168) (clear b6) (arm-empty)
   added: (holding b6) (clear b168)
   goals met: 3 of 7
34. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 4 of 7
35. (unstack b1 b38)
   deleted: (on b1 b38) (clear b1) (arm-empty)
   added: (holding b1) (clear b38)
   goals met: 4 of 7
36. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 7
37. (unstack b38 b128)
   deleted: (on b38 b128) (clear b38) (arm-empty)
   added: (holding b38) (clear b128)
   goals met: 4 of 7
38. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 4 of 7
39. (unstack b128 b5)
   deleted: (on b128 b5) (clear b128) (arm-empty)
   added: (holding b128) (clear b5)
   goals met: 4 of 7
40. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 4 of 7
41. (unstack b5 b175)
   deleted: (on b5 b175) (clear b5) (arm-empty)
   added: (holding b5) (clear b175)
   goals met: 4 of 7
42. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 5 of 7
43. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
44. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 6 of 7
45. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 7
46. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 7 of 7
